Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/the_irish_education_system/measures_to_address_educational_disadvantage.html.txt.tmx
Source language: en
Languages: ga

source: Measures to address educational disadvantage
ga: Bearta le dul i ngleic le míbhuntáiste oideachasúil

source: • Delivering Equality of Opportunity in Schools (DEIS)
ga: • Ag soláthar Comhdheiseanna i Scoileanna (SCS)

source: • Special projects for disadvantaged youth
ga: • Tionscadail speisialta d'ógánaigh faoi mhíbhuntáiste

source: Educational disadvantage refers to the situation where some individuals get less benefit from the education system than their peers
ga: Tagraíonn míbhuntáiste oideachasúil don chás ina bhfaigheann daoine áirithe buntáiste níos lú ón gcóras oideachais ná a gcomhpháirtithe

source: The Education Act 1998 defines educational disadvantage as “the impediments to education arising from social or economic disadvantage which prevent students from deriving appropriate benefit from education in schools”
ga: Sainmhíníonn an tAcht Oideachais 1998 mhíbhuntáiste oideachasúil mar "na baic ar an oideachas de dhroim míbhuntáiste shóisialta nó eacnamaíoch a choisceann mic léinn ar thairbhe chuí a bhaint as an oideachas i scoileanna"

source: Educational disadvantage is demonstrated in many ways, most often in poor levels of participation and achievement in the formal education system
ga: Léirítear míbhuntáiste oideachasúil ar go leor bealaí, go príomha i leibhéil ísle rannpháirtíochta agus baint amach éachta sa chóras oideachais fhoirmiúil

source: There are other ways in which children may be disadvantaged, for example as a result of a disability, literacy difficulties, ill health, poverty etc
ga: Tá bealaí eile ann do pháistí a bheith thíos leis, mar shampla, mar gheall ar mhíchumas, deacrachtaí litearthachta, drochshláinte, bochtaineacht etc

source: Read about the supports for their education in special needs education, psychological services for schools and financial help with going to school
ga: Léigh faoi na tacaíochtaí dá n-oideachas i riachtanais speisialta oideachais, seirbhísí síceolaíochta do scoileanna agus cabhair airgeadais le dul ar scoil

source: Delivering Equality of Opportunity in Schools (DEIS)
ga: Ag soláthar Comhdheiseanna i Scoileanna (SCS)

source: The Department of Education and Skills had a range of national programmes in place to address educational disadvantage throughout the public school system
ga: Tá réimse de chláir náisiúnta i bhfeidhm ag an Roinn Oideachais agus Scileanna chun dul i ngleic le míbhuntáiste oideachasúil sa chóras scoile phoiblí

source: In 2005, following a review of these programmes, the Department published DEIS - Delivering Equality of Opportunity in Schools: an action plan for educational inclusion (pdf)
ga: I 2005, tar éis athbhreithnithe na gclár seo, d'fhoilsigh an Roinn, DEIS - Delivering Equality of Opportunity in Schools: an action plan for social inclusion (pdf)

source: The plan brought a number of those programmes together under the framework of Delivering Equality of Opportunity in Schools (DEIS)
ga: Tugann an plean cuid de na cláir le chéile faoi chreatlach Ag Soláthar Comhdheiseanna i Scoileanna (SCS)

source: DEIS is a more integrated approach to the issue of educational inclusion which provides for:
ga: Is cur chuige níos comhtháite é do cheist an chuimsithe oideachasúil dhéanann soláthar i gcomhair:

source: • A standardised system for identifying and regularly reviewing levels of disadvantage and
ga: • Córas caighdeánaithe chun leibhéil míbhuntáiste a aithint agus a athbhreithniú ó am go ham agus

source: • A new integrated School Support Programme (SSP) to bring together and build upon the previous schemes and programmes
ga: • Clár Tacaíochta Scoile (CTS) nua comhtháite a thabharfaidh le chéile agus a neartóidh na scéimeanna agus na cláir atá ann cheana féin mar seo a leanas

source: There is a list of DEIS schools
ga: Tá liosta ann de na scoileanna sa Chlár Tacaíochta Scoile

source: The School Support Programme involving the Home School Community Liaison Scheme (HSCL), the School Completion Programme (SCP) and the Visiting Teachers Service for Travellers (VTST) were integrated into the National Educational Welfare Board (NEWB) whose functions transferred to the Child and Family Agency in January 2014
ga: Bhí an Clár Tacaíochta Scoile lena n-áirítear an Scéim Teagmhála Baile Scoile agus an Phobail (STBSP), an Clár um Chríochnú Scoile (CCS) agus an tSeirbhís Múinteoir Cuairte ann don Lucht Siúil (SMCLS) comhtháite faoin mBord Náisiúnta Leasa Oideachais. Cuireadh deireadh leis an mBord Náisiúnta Leasa Oideachais an 1 Eanáir 2014 agus d’aistríodh a fheidhmeanna chuig an nGníomhaireacht um Leanaí agus an Teaghlach

source: Early Start Pre-School Scheme
ga: Scéim Réamhscoile an Tús Luath

source: Early Start is a one-year preventative intervention scheme offered to pre-school children (3 to 4 years old) in some schools in designated disadvantaged areas
ga: Is scéim coisctheach idirghabhála aon bhliain An Tús Luath tairgthe do pháistí réamhscoile (3 go 4 bliana d'aois) i roinnt scoileanna i gceantair a aithnítear a bheith faoi mhíbhuntáiste

source: More detailed information about Early Start is available
ga: Tá níos mó mioneolais faoi Thús Luath ar fáil

source: The School Completion Programme aims to help students from disadvantaged areas stay in school to complete their Leaving Certificate
ga: Tá sé de chuspóir ag an gClár Críochnaithe Scoile cabhrú le mic léinn ó cheantair faoi mhíbhuntáiste fanacht sa scoil chun a nArdteistiméireacht a chur i gcrích

source: It is a support strand within the Child and Family Agency under the Department of Children and Youth Affairs
ga: Snáithe thacaíochta atá sa chlár laistigh den Bhord Náisiúnta um Leas Oideachais faoin Roinn Leanaí agus Gnóthaí Óige

source: It forms part of the Department of Education and Skills social inclusion strategy Delivering Equality of Opportunity in Schools (DEIS) to help children and young people who are at risk of or who are experiencing educational disadvantage
ga: Cruthaíonn sé cuid de straitéis cuimsithe shóisialta na Roinne Oideachais agus Scileanna – Comhionannas Deiseanna i Scoileanna a Sheachadadh (DEIS), chun cabhrú le leanaí agus le hógánaigh atá i mbaol nó atá faoi mhíbhuntáiste oideachais

source: Home-School Community Liaison Scheme
ga: An Scéim Teagmhála Baile Scoile agus an Phobail

source: The Home-School Community Liaison Scheme aims to improve co-operation between home, schools and communities to advance the educational interests of disadvantaged children
ga: Tá sé mar aidhm ag an Scéim Teagmhála Baile Scoile agus an Phobail feabhas a chur ar chomhoibriú idir bhaile, scoileanna agus pobail chun leasanna oideachasúla na ndaltaí faoi mhíbhuntáiste a chur chun cinn

source: The Learning Support Teacher Scheme
ga: An Scéim Mhúinteora Tacaíochta Foghlama

source: Learning support teachers provide extra support teaching for children experiencing learning difficulties, particularly in the core areas of literacy and numeracy
ga: Soláthraíonn múinteoirí tacaíochta foghlama tacaíocht bhreise múinteoireachta do pháistí a mbíonn deacrachtaí foghlama acu, go háirithe i gcroí limistéir na litearthachta agus na huimhearthachta

source: Generally this extra support is provided in the form of extra teaching in small groups or individually
ga: Go ginearálta, soláthraítear an tacaíocht bhreise seo i bhfoirm na múinteoireachta breise i ngrúpaí beaga nó ina n-aonar

source: The School Meals Programme aims to supplement the diets of school-going children from disadvantaged backgrounds to help them fulfil their potential within the educational system and to reduce the risk of early school-leaving
ga: Tá sé mar aidhm ag Clár na mBéilí Scoile cur le haistí bia na bpáistí scoile ó chúlraí faoi mhíbhuntáiste chun a gcumas a chomhlíonadh laistigh den chóras oideachais agus chun baol fágála na scoile go luath a laghdú

source: There are two schemes
ga: Tá dhá scéim ann

source: The Urban Scheme supports school meals for primary schools in urban areas
ga: Tacaíonn an Scéim Uirbeach le béilí scoile i mbunscoileanna i gceantair uirbeacha

source: This programme consists of daily sandwiches or buns and milk
ga: Ceapairí nó borróga agus bainne atá i gceist sa chlár seo

source: The scheme is not a replacement for home meals
ga: Ní in ionad béilí baile an scéim seo

source: The Local Projects Scheme gives funding directly to national and secondary schools, local groups and voluntary organisations, which operate their own school meals projects (the meals may be hot or cold)
ga: Tugann Scéim na dTionscadal áitiúil maoiniú go díreach do scoileanna náisiúnta agus do mheánscoileanna, do ghrúpaí áitiúla agus d'eagraíochtaí deonacha, a oibríonn a dtionscadail bhéilí scoile féin (d'fhéadfadh na béilí a bheith te nó fuar)

source: It also covers nursery schools catering for disadvantaged pre-school children
ga: Clúdaíónn an scéim naíonraí atá ag freastal ar pháistí réamh-scoile faoi mhíbhuntáiste

source: These meals must be targeted at areas of disadvantage or at children with special needs
ga: Caithfidh na béilí seo a bheith dírithe ar cheantair faoi mhíbhuntáiste nó ar pháistí le riachtanais speisialta

source: Funding is allocated on the basis of a rate per meal per child
ga: Cuirtear maoiniú ar fáil ar bhonn ráta de réir an bhéile de réir an pháiste

source: Funding for school meals comes from the Department of Social Protection and local authorities
ga: Tagann maoiniú i gcomhair béilí scoile ón Roinn Coimirce Sóisialaí agus ó na húdaráis áitiúla

source: Special projects for disadvantaged youth
ga: Tionscadail speisialta d'ógánaigh faoi mhíbhuntáiste

source: These projects are geared towards young people in the second-level education age group but they are also relevant for some primary school students
ga: Tá na tionscadail dírithe ar dhaoine óige san aoisghrúpa oideachais dara leibhéil ach tá baint acu freisin le roinnt daltaí bunscoile

source: DES Projects for Disadvantaged Youth
ga: Tionscadail speisialta d'ógánaigh faoi mhíbhuntáiste

source: Under this scheme, grants are allocated by the Department of Education and Skills (DES) in respect of special out-of-school projects for disadvantaged young people
ga: Faoin scéim seo, tugann an Roinn Oideachais agus Scileanna deontais do thionscadail speisialta lasmuigh den scoil do dhaoine óige faoi mhíbhuntáiste

source: Priority is given to projects in the spheres of special youth work initiatives, young homeless people, young substance abusers and young Travellers
ga: Tugtar tús áite do thionscadail i réimsí tionscnaimh obair speisialta don aos óg, daoine óga gan dídean, mí-úsáidóirí óga substaintí agus taistealaithe óga

source: The projects are aimed at facilitating the personal development and social education of young people at risk of drug abuse, juvenile crime, early school leaving, social exclusion, unemployment, welfare dependence,homelessness and marginalisation
ga: Tá na tionscadail dírithe ar fhorbairt phearsanta agus oideachas sóisialta na ndaoine óga atá i mbaol ó mhí-úsáid drugaí, ógchoireacht, luathfhágáil scoile, eisiamh sóisialta, dífhostaíocht, spleáchas ar leasa, easpa dídine agus imeallú a éascú

source: In particular, they seek to realise the potential of young people and to equip them with the knowledge, skills and attitudes necessary for their appropriate integration in society
ga: Go háirithe, déanann siad iarracht cumas na ndaoine óga a fhorbairt agus iad a sholáthar le heolas, scileanna agus dearcadh atá riachtanach lena lánpháirtiú oiriúnach sa tsochaí

source: The DES funds the network of Youth Information Centres (pdf) which provide young people with access to information on rights, opportunities, benefits, health, welfare and other matters
ga: Maoiníonn an Roinn Oideachais agus Scileanna líonra de Lárionaid Eolais don Ógra (pdf) a sholáthraíonn bealach isteach chuig eolas ar chearta, deiseanna, sochair, sláinte, leas agus ábhair eile

source: Young People's Facilities and Services Fund (YPFSF)
ga: Ciste do Áiseanna agus Seirbhísí d'Ógra (CÁSÓ)

source: This was established to help in the development of preventative strategies in a targeted manner through the development of youth facilities, including sport and recreational facilities, and services in disadvantaged areas where a significant drug problem exists or has the potential to develop
ga: Cuidíonn an scéim seo le forbairt straitéisí coisctheacha i mbealach dírithe, trí áiseanna don ógra, spórt agus áiseanna caitheamh aimsire ina measc, agus seirbhísí i gceantair faoi mhíbhuntáiste áiteanna a bhfuil fadhbanna suntasacha drugaí nó seans go mbeidh sna todhchaí

source: The aim of the fund is to attract young people in these areas at risk of becoming involved in drugs into more healthy and productive pursuits
ga: 'Sé aidhm an chiste ná na daoine óga sna ceantair seo atá i mbaol baint a bheith acu le drugaí a mhealladh isteach in imeachtaí atá níos sláintiúla agus níos táirgiúla

source: For further information on DEIS contact the Social Inclusion Unit of the Department of Education and Skills
ga: Le tuilleadh eolais faoi SCS déan teagmháil le hIonad um Chuimsiú Sóisialta na Roinne Oideachais agus Scileanna

source: For further information on the School Completion Programme contact the Co-ordination Service in the Curriculum Development Unit
ga: Le tuilleadh eolais faoin gClár Críochnaithe Scoile déan teagmháil leis an tSeirbhís Chomhordaithe san Ionad Forbartha Curaclaim

source: For further information on the School Meals Scheme contact your local authority or the Department of Social Protection
ga: Le tuilleadh eolais faoi Scéim na mBéilí Scoile déan teagmháil leis an údarás áitiúil nó an Roinn Coimirce Sóisialaí

source: There is an application form for the School Meals Local Projects Scheme (pdf)
ga: Tá foirm iarratais ann don Scéim na dTionscadal Áitiúil na mBéilí Scoile (pdf)

source: You can download the Good Practice Guide for School Food Initiatives (pdf) here
ga: Is féidir leat an Treoir Dhea-Chleachtais do Thionscnaimh na mBéilí Scoile (pdf) a íoslódáil anseo

source: Contact your local Education and Training Board (ETB) for funding for DES Projects for Disadvantaged Youth
ga: Déan teagmháil le do Boird Oideachais agus Oiliúna (BOO) áitiúil féin le haghaidh maoinithe do thionscadail ROE d'Ógra faoi Mhíbhuntáiste

source: Contact the Department of Children and Youth Affairs for funding for the YPFSF
ga: Déan teagmháil leis an an Roinn Leanaí agus Gnóthaí Óige le haghaidh maoinithe do CÁSÓ
